000001 IDENTIFICATION DIVISION. 
000002     PROGRAM-ID. WriteFile.
000003     AUTHOR. Marcob.
000004
000005 ENVIRONMENT DIVISION.
000006 INPUT-OUTPUT SECTION.
000007     FILE-CONTROL.
000008     SELECT EMPLOYEES ASSIGN TO "EMPLOYEES.DATA"
000009         ORGANIZATION IS LINE SEQUENTIAL.
000010
000011 DATA DIVISION.
000012 FILE SECTION.
000013     FD EMPLOYEES.
000014     01 EMPLOYEE-RECORD.
000015        05 EMPLOYEE-ID     PIC 9(5).
000016        05 EMPLOYEE-NAME.
000017           10 FIRST-NAME   PIC X(20).
000018           10 LAST-NAME    PIC X(20).
000019        05 EMPLOYEE-GENDER PIC X(1).
000020
000021 WORKING-STORAGE SECTION.
000022 01 WS-EMPLOYEE-RECORD.
000023     05 WS-EMPLOYEE-ID     PIC 9(5).
000024     05 WS-EMPLOYEE-NAME.
000025        10 WS-FIRST-NAME   PIC X(20).
000026        10 WS-LAST-NAME    PIC X(20).
000027     05 WS-EMPLOYEE-GENDER PIC X(1).
000028     01 WS-OPTION PIC X VALUE SPACE.
000029 
000030 PROCEDURE DIVISION.
000031 PRINCIPAL.
000032     DISPLAY "============================================".
000033     DISPLAY "Employee Data Entry Program".
000034     DISPLAY "============================================".
000035
000036     OPEN OUTPUT EMPLOYEES.
000037     PERFORM UNTIL-END.
000038     CLOSE EMPLOYEES.
000039
000040     DISPLAY "============================================".
000041     DISPLAY "Employee data entry completed. File created.".
000042     DISPLAY "============================================".
000043     STOP RUN.
000044 
000045 UNTIL-END.
000046     PERFORM UNTIL WS-OPTION = "N" OR WS-OPTION = "n"
000047         PERFORM GET-DATA
000048         PERFORM WRITE-FILE
000049         DISPLAY "Do you want to enter another " 
000050               "employee record? (Y/N) "
000051         WITH NO ADVANCING 
000052             ACCEPT WS-OPTION
000053     END-PERFORM.
000054
000055 GET-DATA.
000056     DISPLAY "Enter Employee ID (5 digits): " WITH NO ADVANCING
000057     ACCEPT WS-EMPLOYEE-ID.
000058     
000059     DISPLAY "Enter Employee First Name: " WITH NO ADVANCING
000060     ACCEPT WS-FIRST-NAME.
000061     
000062     DISPLAY "Enter Employee Last Name: " WITH NO ADVANCING
000063     ACCEPT WS-LAST-NAME.
000064 
000065     DISPLAY "Enter Employee Gender (M/F): " WITH NO ADVANCING
000066     ACCEPT WS-EMPLOYEE-GENDER.
000067
000068 WRITE-FILE.
000069     MOVE WS-EMPLOYEE-ID TO EMPLOYEE-ID.
000070     MOVE WS-FIRST-NAME TO FIRST-NAME.
000071     MOVE WS-LAST-NAME TO LAST-NAME.
000072     MOVE WS-EMPLOYEE-GENDER TO EMPLOYEE-GENDER.
000073     WRITE EMPLOYEE-RECORD.
000074
000075 END PROGRAM WriteFile.
