000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. CRUD.
000003 AUTHOR. Marcovb.
000004
000005 ENVIRONMENT DIVISION.
000006 INPUT-OUTPUT SECTION.
000007 FILE-CONTROL.
000008     SELECT PROFESSOR-ARQ ASSIGN TO "PROFESSORS.idx"
000009         ORGANIZATION IS INDEXED
000010         ACCESS MODE IS DYNAMIC
000011         RECORD KEY IS PROFESSOR-ID
000012         FILE STATUS IS WS-STATUS.
000013
000014 
000015 DATA DIVISION.
000016 FILE SECTION.
000017     FD PROFESSOR-ARQ.
000018     01 PROFESSOR-REG.
000019         05 PROFESSOR-ID      PIC X(8).
000020         05 PROFESSOR-NAME    PIC X(30).
000021
000022 WORKING-STORAGE SECTION.
000023     01 WS-PROFESSOR-REG.
000024         05 WS-PROFESSOR-ID   PIC X(8).
000025         05 WS-PROFESSOR-NAME PIC X(30).
000026     01 WS-STATUS             PIC X(2).
000027     01 WS-OPTION             PIC 9.
000028
000029 PROCEDURE DIVISION.
000030 PRINCIPAL.
000031     DISPLAY "============================================".
000032     DISPLAY "PROFESSOR MENU".
000033     DISPLAY "============================================".
000034     DISPLAY "1 - CREATE PROFESSOR REGISTER".
000035     DISPLAY "2 - SHOW PROFESSOR REGISTER".
000036     DISPLAY "3 - MODIFY PROFESSOR REGISTER".
000037     DISPLAY "4 - DELETE PROFESSOR REGISTER".
000038     DISPLAY "5 - EXIT".
000039     DISPLAY "CHOOSE OPTION: ".
000040     DISPLAY "============================================".
000041     ACCEPT WS-OPTION.
000042
000043     EVALUATE WS-OPTION
000044         WHEN 1
000045             PERFORM CREATE-REGISTER
000046         WHEN 2
000047             PERFORM SHOW-REGISTER
000048         WHEN 3
000049             PERFORM MODIFY-REGISTER
000050         WHEN 4
000051             PERFORM DELETE-REGISTER
000052         WHEN 5
000053             STOP RUN
000054         WHEN OTHER
000055             DISPLAY "INVALID OPTION"
000056         PERFORM PRINCIPAL
000057     END-EVALUATE.
000058
000059 OPEN-FILE.
000060     OPEN I-O PROFESSOR-ARQ.
000061         IF WS-STATUS = "35"
000062             OPEN OUTPUT PROFESSOR-ARQ
000063             CLOSE PROFESSOR-ARQ
000064             OPEN I-O PROFESSOR-ARQ
000065         END-IF.
000066
000067 CLOSE-FILE.
000068     CLOSE PROFESSOR-ARQ.
000069
000070 CREATE-REGISTER.
000071     DISPLAY "=============================================".
000072     DISPLAY "CREATE PROFESSOR REGISTER".
000073     DISPLAY "=============================================".
000074     DISPLAY "ENTER PROFESSOR ID (8 characters): ".
000075     ACCEPT WS-PROFESSOR-ID.
000076     DISPLAY "ENTER PROFESSOR NAME: ".
000077     ACCEPT WS-PROFESSOR-NAME.
000078
000079     MOVE WS-PROFESSOR-ID TO PROFESSOR-ID.
000080     MOVE WS-PROFESSOR-NAME TO PROFESSOR-NAME.
000081
000082     PERFORM OPEN-FILE.
000083     WRITE PROFESSOR-REG
000084         INVALID KEY DISPLAY "ERROR: PROFESSOR ID ALREADY EXISTS".
000085     PERFORM CLOSE-FILE.
000086     DISPLAY "PROFESSOR REGISTER CREATED SUCCESSFULLY".
000087     PERFORM PRINCIPAL.
000088
000089 SHOW-REGISTER.
000090     DISPLAY "=============================================".
000091     DISPLAY "SHOW PROFESSOR REGISTER".
000092     DISPLAY "=============================================".
000093     DISPLAY "ENTER PROFESSOR ID (8 characters): ".
000094     ACCEPT WS-PROFESSOR-ID.
000095
000096     MOVE WS-PROFESSOR-ID TO PROFESSOR-ID.
000097     PERFORM OPEN-FILE.
000098     READ PROFESSOR-ARQ KEY IS PROFESSOR-ID
000099         INVALID KEY
000100             DISPLAY "ERROR: PROFESSOR ID NOT FOUND"
000101         NOT INVALID KEY
000102             DISPLAY "PROFESSOR ID: " PROFESSOR-ID
000103             DISPLAY "PROFESSOR NAME: " PROFESSOR-NAME
000104     END-READ.
000105     PERFORM CLOSE-FILE.
000106     PERFORM PRINCIPAL.
000107
000108 MODIFY-REGISTER.
000109     DISPLAY "=============================================".
000110     DISPLAY "MODIFY PROFESSOR REGISTER".
000111     DISPLAY "=============================================".
000112     DISPLAY "ENTER PROFESSOR ID (8 characters): ".
000113     ACCEPT WS-PROFESSOR-ID.
000114
000115     MOVE WS-PROFESSOR-ID TO PROFESSOR-ID.
000116     PERFORM OPEN-FILE.
000117     READ PROFESSOR-ARQ KEY IS PROFESSOR-ID
000118         INVALID KEY
000119             DISPLAY "ERROR: PROFESSOR ID NOT FOUND"
000120         NOT INVALID KEY
000121             DISPLAY "ENTER NEW PROFESSOR NAME: "
000122             ACCEPT WS-PROFESSOR-NAME
000123             MOVE WS-PROFESSOR-NAME TO PROFESSOR-NAME
000124             REWRITE PROFESSOR-REG
000125             DISPLAY "PROFESSOR REGISTER MODIFIED SUCCESSFULLY"
000126     END-READ.
000127     PERFORM CLOSE-FILE.
000128     PERFORM PRINCIPAL.
000129
000130 DELETE-REGISTER.
000131     DISPLAY "=============================================".
000132     DISPLAY "DELETE PROFESSOR REGISTER".
000133     DISPLAY "=============================================".
000134     DISPLAY "ENTER PROFESSOR ID (8 characters): ".
000135     ACCEPT WS-PROFESSOR-ID.
000136
000137     MOVE WS-PROFESSOR-ID TO PROFESSOR-ID.
000138     PERFORM OPEN-FILE.
000139     READ PROFESSOR-ARQ KEY IS PROFESSOR-ID
000140         INVALID KEY
000141             DISPLAY "ERROR: PROFESSOR ID NOT FOUND"
000142         NOT INVALID KEY
000143             DELETE PROFESSOR-ARQ
000144             DISPLAY "PROFESSOR REGISTER DELETED SUCCESSFULLY"
000145     END-READ.
000146     PERFORM CLOSE-FILE.
000147     PERFORM PRINCIPAL.
000148
000149 END PROGRAM CRUD.
