000001 IDENTIFICATION DIVISION. 
000002     PROGRAM-ID. Calculator.
000003     AUTHOR. Marcob.
000004
000005 ENVIRONMENT DIVISION.
000006 
000007 DATA DIVISION. 
000008 WORKING-STORAGE SECTION.
000009 01 WS-NUMBER1  PIC 9(8)v99.
000010 01 WS-NUMBER2  PIC 9(8)v99.
000011 01 WS-OPERATOR PIC X.
000012 01 WS-RESULT   PIC Z(8).99.
000013       
000014 PROCEDURE DIVISION.
000015 PRINCIPAL.
000016     DISPLAY "CALCULATOR +-/*".
000017     DISPLAY "ENTER THE FIRST NUMBER: ".
000018     ACCEPT WS-NUMBER1.
000019     DISPLAY "ENTER THE SECOND NUMBER: ".
000020     ACCEPT WS-NUMBER2.
000021     DISPLAY "ENTER THE OPERATOR: ".
000022     ACCEPT WS-OPERATOR.
000023     EVALUATE WS-OPERATOR
000024        WHEN "+"
000025            COMPUTE WS-RESULT = WS-NUMBER1 + WS-NUMBER2
000026        WHEN "-"
000027            COMPUTE WS-RESULT = WS-NUMBER1 - WS-NUMBER2
000028        WHEN "*"
000029            COMPUTE WS-RESULT = WS-NUMBER1 * WS-NUMBER2
000030        WHEN "/"
000031            IF WS-NUMBER2 NOT = 0
000032               COMPUTE WS-RESULT = WS-NUMBER1 / WS-NUMBER2
000033            ELSE
000034               DISPLAY "ERROR: DIVISION BY ZERO"
000035               GOBACK
000036            END-IF
000037              WHEN OTHER
000038                  DISPLAY "ERROR: INVALID OPERATOR"
000039                  GOBACK
000040           END-EVALUATE.
000041           DISPLAY "RESULT: " WS-RESULT.
000042
000043 STOP RUN.
000044 END PROGRAM Calculator.
