000001 IDENTIFICATION DIVISION. 
000002     PROGRAM-ID. ReadFile.
000003     AUTHOR. Marcob.
000004
000005 ENVIRONMENT DIVISION.
000006 INPUT-OUTPUT SECTION.
000007 FILE-CONTROL.
000008     SELECT EMPLOYEES ASSIGN TO "EMPLOYEES.DATA"
000009         ORGANIZATION IS LINE SEQUENTIAL.
000010 DATA DIVISION.
000011 FILE SECTION.
000012 FD EMPLOYEES.
000013 01 EMPLOYEE-RECORD.
000014     88 END-OF-FILE VALUE HIGH-VALUES.
000015     05 EMPLOYEE-ID   PIC 9(5).
000016     05 EMPLOYEE-NAME.
000017        10 FIRST-NAME PIC X(20).
000018        10 LAST-NAME  PIC X(20).
000019     05 EMPLOYEE-GENDER PIC X(1).
000020
000021 WORKING-STORAGE SECTION.
000022 01 COUNTERS.
000023     05 EMPLOYEE-COUNT PIC 9(5) VALUE ZERO.
000024     05 MALE-COUNT     PIC 9(5) VALUE ZERO.
000025     05 FEMALE-COUNT   PIC 9(5) VALUE ZERO.
000026 01 END-OF-READ PIC X VALUE "N".
000027 
000028 PROCEDURE DIVISION.
000029 PRINCIPAL.
000030     DISPLAY "=============================".
000031     DISPLAY "READING EMPLOYEES DATA".
000032     DISPLAY "=============================".
000033
000034*****OPEN THE FILE
000035     OPEN INPUT EMPLOYEES.
000036
000037*****FILE DATA PROCESSING
000038     PERFORM UNTIL END-OF-READ = "Y"
000039         READ EMPLOYEES INTO EMPLOYEE-RECORD
000040             AT END
000041                 MOVE "Y" TO END-OF-READ
000042             NOT AT END
000043                 INSPECT FIRST-NAME REPLACING ALL " "
000044                     BY LOW-VALUES
000045                 INSPECT LAST-NAME REPLACING ALL " " BY LOW-VALUES
000046                 DISPLAY EMPLOYEE-ID " " EMPLOYEE-GENDER " "
000047                     FIRST-NAME " " LAST-NAME
000048                 ADD 1 TO EMPLOYEE-COUNT
000049                 IF EMPLOYEE-GENDER =  "M"
000050                     ADD 1 TO MALE-COUNT
000051                 ELSE
000052                     IF EMPLOYEE-GENDER = "F"
000053                         ADD 1 TO FEMALE-COUNT
000054                     END-IF
000055                 END-IF
000056         END-READ
000057     END-PERFORM.
000058*****CLOSE THE FILE
000059     CLOSE EMPLOYEES.
000060*****DISPLAY THE RESULTS
000061     DISPLAY "=============================".
000062     DISPLAY "EMPLOYEES COUNT: " EMPLOYEE-COUNT.
000063     DISPLAY "MALE COUNT: " MALE-COUNT.
000064     DISPLAY "FEMALE COUNT: " FEMALE-COUNT.
000065     DISPLAY "=============================".
000066
000067 STOP RUN.
000068 END PROGRAM ReadFile.
